; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob29) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate12)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear crate13)
	(at pallet3 distributor0)
	(clear pallet3)
	(at pallet4 distributor1)
	(clear crate6)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear crate5)
	(at pallet7 depot2)
	(clear crate9)
	(at pallet8 distributor1)
	(clear pallet8)
	(at pallet9 distributor0)
	(clear pallet9)
	(at pallet10 distributor2)
	(clear crate4)
	(at pallet11 depot1)
	(clear pallet11)
	(at pallet12 distributor1)
	(clear crate11)
	(at pallet13 depot0)
	(clear crate14)
	(at pallet14 depot2)
	(clear pallet14)
	(at truck0 depot2)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot2)
	(available hoist6)
	(at crate0 depot0)
	(on crate0 pallet13)
	(at crate1 depot2)
	(on crate1 pallet2)
	(at crate2 distributor2)
	(on crate2 pallet6)
	(at crate3 distributor2)
	(on crate3 pallet10)
	(at crate4 distributor2)
	(on crate4 crate3)
	(at crate5 distributor2)
	(on crate5 crate2)
	(at crate6 distributor1)
	(on crate6 pallet4)
	(at crate7 depot0)
	(on crate7 crate0)
	(at crate8 depot0)
	(on crate8 crate7)
	(at crate9 depot2)
	(on crate9 pallet7)
	(at crate10 depot2)
	(on crate10 crate1)
	(at crate11 distributor1)
	(on crate11 pallet12)
	(at crate12 depot0)
	(on crate12 pallet0)
	(at crate13 depot2)
	(on crate13 crate10)
	(at crate14 depot0)
	(on crate14 crate8)
)

(:goal (and
		(on crate1 pallet7)
		(on crate3 pallet12)
		(on crate5 pallet1)
		(on crate6 pallet5)
		(on crate8 pallet11)
		(on crate9 pallet4)
		(on crate10 pallet13)
		(on crate11 pallet6)
		(on crate12 pallet0)
		(on crate13 crate11)
		(on crate14 crate8)
	)
))

; plan
1. (drive truck1 depot1 depot0)
   deleted: (at truck1 depot1)
   added: (at truck1 depot0)
   goals met: 2 of 11
2. (lift hoist6 crate13 crate10 depot2)
   deleted: (at crate13 depot2) (clear crate13) (available hoist6) (on crate13 crate10)
   added: (lifting hoist6 crate13) (clear crate10)
   goals met: 2 of 11
3. (load hoist6 crate13 truck0 depot2)
   deleted: (lifting hoist6 crate13)
   added: (in crate13 truck0) (available hoist6)
   goals met: 2 of 11
4. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 2 of 11
5. (lift hoist2 crate10 crate1 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist2) (on crate10 crate1)
   added: (lifting hoist2 crate10) (clear crate1)
   goals met: 2 of 11
6. (lift hoist6 crate9 pallet7 depot2)
   deleted: (at crate9 depot2) (clear crate9) (available hoist6) (on crate9 pallet7)
   added: (lifting hoist6 crate9) (clear pallet7)
   goals met: 2 of 11
7. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 2 of 11
8. (load hoist2 crate10 truck0 depot2)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   goals met: 2 of 11
9. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   goals met: 2 of 11
10. (lift hoist2 crate1 pallet2 depot2)
   deleted: (at crate1 depot2) (clear crate1) (available hoist2) (on crate1 pallet2)
   added: (lifting hoist2 crate1) (clear pallet2)
   goals met: 2 of 11
11. (drop hoist2 crate1 pallet7 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet7)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 pallet7)
   goals met: 3 of 11
12. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   goals met: 3 of 11
13. (load hoist6 crate9 truck0 depot2)
   deleted: (lifting hoist6 crate9)
   added: (in crate9 truck0) (available hoist6)
   goals met: 3 of 11
14. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   goals met: 3 of 11
15. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 3 of 11
16. (lift hoist4 crate6 pallet4 distributor1)
   deleted: (at crate6 distributor1) (clear crate6) (available hoist4) (on crate6 pallet4)
   added: (lifting hoist4 crate6) (clear pallet4)
   goals met: 3 of 11
17. (load hoist4 crate6 truck0 distributor1)
   deleted: (lifting hoist4 crate6)
   added: (in crate6 truck0) (available hoist4)
   goals met: 3 of 11
18. (unload hoist4 crate13 truck0 distributor1)
   deleted: (in crate13 truck0) (available hoist4)
   added: (lifting hoist4 crate13)
   goals met: 3 of 11
19. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 3 of 11
20. (drop hoist4 crate13 pallet8 distributor1)
   deleted: (lifting hoist4 crate13) (clear pallet8)
   added: (available hoist4) (at crate13 distributor1) (clear crate13) (on crate13 pallet8)
   goals met: 3 of 11
21. (lift hoist5 crate5 crate2 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate2)
   added: (lifting hoist5 crate5) (clear crate2)
   goals met: 3 of 11
22. (load hoist5 crate5 truck0 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck0) (available hoist5)
   goals met: 3 of 11
23. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 3 of 11
24. (unload hoist1 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 3 of 11
25. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 3 of 11
26. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 3 of 11
27. (drop hoist1 crate5 pallet1 depot1)
   deleted: (lifting hoist1 crate5) (clear pallet1)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 pallet1)
   goals met: 4 of 11
28. (unload hoist4 crate9 truck0 distributor1)
   deleted: (in crate9 truck0) (available hoist4)
   added: (lifting hoist4 crate9)
   goals met: 4 of 11
29. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   goals met: 4 of 11
30. (drop hoist4 crate9 pallet4 distributor1)
   deleted: (lifting hoist4 crate9) (clear pallet4)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 pallet4)
   goals met: 5 of 11
31. (unload hoist5 crate6 truck0 distributor2)
   deleted: (in crate6 truck0) (available hoist5)
   added: (lifting hoist5 crate6)
   goals met: 5 of 11
32. (drop hoist5 crate6 pallet5 distributor2)
   deleted: (lifting hoist5 crate6) (clear pallet5)
   added: (available hoist5) (at crate6 distributor2) (clear crate6) (on crate6 pallet5)
   goals met: 6 of 11
33. (lift hoist5 crate4 crate3 distributor2)
   deleted: (at crate4 distributor2) (clear crate4) (available hoist5) (on crate4 crate3)
   added: (lifting hoist5 crate4) (clear crate3)
   goals met: 6 of 11
34. (drop hoist5 crate4 crate6 distributor2)
   deleted: (lifting hoist5 crate4) (clear crate6)
   added: (available hoist5) (at crate4 distributor2) (clear crate4) (on crate4 crate6)
   goals met: 6 of 11
35. (lift hoist5 crate3 pallet10 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 pallet10)
   added: (lifting hoist5 crate3) (clear pallet10)
   goals met: 6 of 11
36. (load hoist5 crate3 truck0 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck0) (available hoist5)
   goals met: 6 of 11
37. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 6 of 11
38. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   goals met: 6 of 11
39. (unload hoist4 crate3 truck0 distributor1)
   deleted: (in crate3 truck0) (available hoist4)
   added: (lifting hoist4 crate3)
   goals met: 6 of 11
40. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   goals met: 6 of 11
41. (drop hoist4 crate3 crate9 distributor1)
   deleted: (lifting hoist4 crate3) (clear crate9)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 crate9)
   goals met: 6 of 11
42. (lift hoist4 crate11 pallet12 distributor1)
   deleted: (at crate11 distributor1) (clear crate11) (available hoist4) (on crate11 pallet12)
   added: (lifting hoist4 crate11) (clear pallet12)
   goals met: 6 of 11
43. (drive truck1 depot0 distributor1)
   deleted: (at truck1 depot0)
   added: (at truck1 distributor1)
   goals met: 6 of 11
44. (load hoist4 crate11 truck1 distributor1)
   deleted: (lifting hoist4 crate11)
   added: (in crate11 truck1) (available hoist4)
   goals met: 6 of 11
45. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 6 of 11
46. (lift hoist4 crate3 crate9 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist4) (on crate3 crate9)
   added: (lifting hoist4 crate3) (clear crate9)
   goals met: 6 of 11
47. (drop hoist4 crate3 pallet12 distributor1)
   deleted: (lifting hoist4 crate3) (clear pallet12)
   added: (available hoist4) (at crate3 distributor1) (clear crate3) (on crate3 pallet12)
   goals met: 7 of 11
48. (unload hoist5 crate11 truck1 distributor2)
   deleted: (in crate11 truck1) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 7 of 11
49. (lift hoist4 crate13 pallet8 distributor1)
   deleted: (at crate13 distributor1) (clear crate13) (available hoist4) (on crate13 pallet8)
   added: (lifting hoist4 crate13) (clear pallet8)
   goals met: 7 of 11
50. (drop hoist5 crate11 pallet10 distributor2)
   deleted: (lifting hoist5 crate11) (clear pallet10)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 pallet10)
   goals met: 7 of 11
51. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   goals met: 7 of 11
52. (load hoist4 crate13 truck1 distributor1)
   deleted: (lifting hoist4 crate13)
   added: (in crate13 truck1) (available hoist4)
   goals met: 7 of 11
53. (drive truck1 distributor1 distributor2)
   deleted: (at truck1 distributor1)
   added: (at truck1 distributor2)
   goals met: 7 of 11
54. (unload hoist5 crate13 truck1 distributor2)
   deleted: (in crate13 truck1) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 7 of 11
55. (drop hoist5 crate13 crate11 distributor2)
   deleted: (lifting hoist5 crate13) (clear crate11)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 crate11)
   goals met: 8 of 11
56. (lift hoist0 crate14 crate8 depot0)
   deleted: (at crate14 depot0) (clear crate14) (available hoist0) (on crate14 crate8)
   added: (lifting hoist0 crate14) (clear crate8)
   goals met: 7 of 11
57. (load hoist0 crate14 truck0 depot0)
   deleted: (lifting hoist0 crate14)
   added: (in crate14 truck0) (available hoist0)
   goals met: 7 of 11
58. (lift hoist0 crate8 crate7 depot0)
   deleted: (at crate8 depot0) (clear crate8) (available hoist0) (on crate8 crate7)
   added: (lifting hoist0 crate8) (clear crate7)
   goals met: 7 of 11
59. (load hoist0 crate8 truck0 depot0)
   deleted: (lifting hoist0 crate8)
   added: (in crate8 truck0) (available hoist0)
   goals met: 7 of 11
60. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 7 of 11
61. (unload hoist1 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 7 of 11
62. (drop hoist1 crate8 pallet11 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet11)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet11)
   goals met: 8 of 11
63. (unload hoist1 crate14 truck0 depot1)
   deleted: (in crate14 truck0) (available hoist1)
   added: (lifting hoist1 crate14)
   goals met: 8 of 11
64. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   goals met: 8 of 11
65. (drop hoist1 crate14 crate8 depot1)
   deleted: (lifting hoist1 crate14) (clear crate8)
   added: (available hoist1) (at crate14 depot1) (clear crate14) (on crate14 crate8)
   goals met: 9 of 11
66. (lift hoist0 crate7 crate0 depot0)
   deleted: (at crate7 depot0) (clear crate7) (available hoist0) (on crate7 crate0)
   added: (lifting hoist0 crate7) (clear crate0)
   goals met: 9 of 11
67. (load hoist0 crate7 truck0 depot0)
   deleted: (lifting hoist0 crate7)
   added: (in crate7 truck0) (available hoist0)
   goals met: 9 of 11
68. (lift hoist0 crate0 pallet13 depot0)
   deleted: (at crate0 depot0) (clear crate0) (available hoist0) (on crate0 pallet13)
   added: (lifting hoist0 crate0) (clear pallet13)
   goals met: 9 of 11
69. (load hoist0 crate0 truck0 depot0)
   deleted: (lifting hoist0 crate0)
   added: (in crate0 truck0) (available hoist0)
   goals met: 9 of 11
70. (unload hoist0 crate10 truck0 depot0)
   deleted: (in crate10 truck0) (available hoist0)
   added: (lifting hoist0 crate10)
   goals met: 9 of 11
71. (lift hoist5 crate13 crate11 distributor2)
   deleted: (at crate13 distributor2) (clear crate13) (available hoist5) (on crate13 crate11)
   added: (lifting hoist5 crate13) (clear crate11)
   goals met: 8 of 11
72. (load hoist5 crate13 truck1 distributor2)
   deleted: (lifting hoist5 crate13)
   added: (in crate13 truck1) (available hoist5)
   goals met: 8 of 11
73. (lift hoist5 crate11 pallet10 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 pallet10)
   added: (lifting hoist5 crate11) (clear pallet10)
   goals met: 8 of 11
74. (load hoist5 crate11 truck1 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck1) (available hoist5)
   goals met: 8 of 11
75. (unload hoist5 crate13 truck1 distributor2)
   deleted: (in crate13 truck1) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 8 of 11
76. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 8 of 11
77. (drop hoist5 crate13 pallet10 distributor2)
   deleted: (lifting hoist5 crate13) (clear pallet10)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 pallet10)
   goals met: 8 of 11
78. (drop hoist0 crate10 pallet13 depot0)
   deleted: (lifting hoist0 crate10) (clear pallet13)
   added: (available hoist0) (at crate10 depot0) (clear crate10) (on crate10 pallet13)
   goals met: 9 of 11
79. (lift hoist5 crate13 pallet10 distributor2)
   deleted: (at crate13 distributor2) (clear crate13) (available hoist5) (on crate13 pallet10)
   added: (lifting hoist5 crate13) (clear pallet10)
   goals met: 9 of 11
80. (unload hoist1 crate11 truck1 depot1)
   deleted: (in crate11 truck1) (available hoist1)
   added: (lifting hoist1 crate11)
   goals met: 9 of 11
81. (drop hoist1 crate11 crate5 depot1)
   deleted: (lifting hoist1 crate11) (clear crate5)
   added: (available hoist1) (at crate11 depot1) (clear crate11) (on crate11 crate5)
   goals met: 9 of 11
82. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 9 of 11
83. (load hoist5 crate13 truck0 distributor2)
   deleted: (lifting hoist5 crate13)
   added: (in crate13 truck0) (available hoist5)
   goals met: 9 of 11
84. (drive truck0 distributor2 depot1)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot1)
   goals met: 9 of 11
85. (lift hoist1 crate11 crate5 depot1)
   deleted: (at crate11 depot1) (clear crate11) (available hoist1) (on crate11 crate5)
   added: (lifting hoist1 crate11) (clear crate5)
   goals met: 9 of 11
86. (load hoist1 crate11 truck0 depot1)
   deleted: (lifting hoist1 crate11)
   added: (in crate11 truck0) (available hoist1)
   goals met: 9 of 11
87. (drive truck0 depot1 distributor2)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor2)
   goals met: 9 of 11
88. (unload hoist5 crate13 truck0 distributor2)
   deleted: (in crate13 truck0) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 9 of 11
89. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 9 of 11
90. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 9 of 11
91. (drop hoist0 crate11 crate12 depot0)
   deleted: (lifting hoist0 crate11) (clear crate12)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate12)
   goals met: 9 of 11
92. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 9 of 11
93. (load hoist5 crate13 truck0 distributor2)
   deleted: (lifting hoist5 crate13)
   added: (in crate13 truck0) (available hoist5)
   goals met: 9 of 11
94. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 9 of 11
95. (lift hoist0 crate11 crate12 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate12)
   added: (lifting hoist0 crate11) (clear crate12)
   goals met: 9 of 11
96. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   goals met: 9 of 11
97. (unload hoist0 crate13 truck0 depot0)
   deleted: (in crate13 truck0) (available hoist0)
   added: (lifting hoist0 crate13)
   goals met: 9 of 11
98. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 9 of 11
99. (unload hoist5 crate11 truck0 distributor2)
   deleted: (in crate11 truck0) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 9 of 11
100. (drop hoist5 crate11 pallet10 distributor2)
   deleted: (lifting hoist5 crate11) (clear pallet10)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 pallet10)
   goals met: 9 of 11
101. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 9 of 11
102. (load hoist0 crate13 truck0 depot0)
   deleted: (lifting hoist0 crate13)
   added: (in crate13 truck0) (available hoist0)
   goals met: 9 of 11
103. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 9 of 11
104. (unload hoist5 crate13 truck0 distributor2)
   deleted: (in crate13 truck0) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 9 of 11
105. (drop hoist5 crate13 crate11 distributor2)
   deleted: (lifting hoist5 crate13) (clear crate11)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 crate11)
   goals met: 10 of 11
106. (lift hoist5 crate2 pallet6 distributor2)
   deleted: (at crate2 distributor2) (clear crate2) (available hoist5) (on crate2 pallet6)
   added: (lifting hoist5 crate2) (clear pallet6)
   goals met: 10 of 11
107. (load hoist5 crate2 truck0 distributor2)
   deleted: (lifting hoist5 crate2)
   added: (in crate2 truck0) (available hoist5)
   goals met: 10 of 11
108. (lift hoist5 crate13 crate11 distributor2)
   deleted: (at crate13 distributor2) (clear crate13) (available hoist5) (on crate13 crate11)
   added: (lifting hoist5 crate13) (clear crate11)
   goals met: 9 of 11
109. (drop hoist5 crate13 pallet6 distributor2)
   deleted: (lifting hoist5 crate13) (clear pallet6)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 pallet6)
   goals met: 9 of 11
110. (lift hoist5 crate11 pallet10 distributor2)
   deleted: (at crate11 distributor2) (clear crate11) (available hoist5) (on crate11 pallet10)
   added: (lifting hoist5 crate11) (clear pallet10)
   goals met: 9 of 11
111. (load hoist5 crate11 truck0 distributor2)
   deleted: (lifting hoist5 crate11)
   added: (in crate11 truck0) (available hoist5)
   goals met: 9 of 11
112. (lift hoist5 crate13 pallet6 distributor2)
   deleted: (at crate13 distributor2) (clear crate13) (available hoist5) (on crate13 pallet6)
   added: (lifting hoist5 crate13) (clear pallet6)
   goals met: 9 of 11
113. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 9 of 11
114. (unload hoist0 crate11 truck0 depot0)
   deleted: (in crate11 truck0) (available hoist0)
   added: (lifting hoist0 crate11)
   goals met: 9 of 11
115. (drop hoist0 crate11 crate12 depot0)
   deleted: (lifting hoist0 crate11) (clear crate12)
   added: (available hoist0) (at crate11 depot0) (clear crate11) (on crate11 crate12)
   goals met: 9 of 11
116. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 9 of 11
117. (load hoist5 crate13 truck0 distributor2)
   deleted: (lifting hoist5 crate13)
   added: (in crate13 truck0) (available hoist5)
   goals met: 9 of 11
118. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   goals met: 9 of 11
119. (lift hoist0 crate11 crate12 depot0)
   deleted: (at crate11 depot0) (clear crate11) (available hoist0) (on crate11 crate12)
   added: (lifting hoist0 crate11) (clear crate12)
   goals met: 9 of 11
120. (load hoist0 crate11 truck0 depot0)
   deleted: (lifting hoist0 crate11)
   added: (in crate11 truck0) (available hoist0)
   goals met: 9 of 11
121. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   goals met: 9 of 11
122. (unload hoist5 crate11 truck0 distributor2)
   deleted: (in crate11 truck0) (available hoist5)
   added: (lifting hoist5 crate11)
   goals met: 9 of 11
123. (drop hoist5 crate11 pallet6 distributor2)
   deleted: (lifting hoist5 crate11) (clear pallet6)
   added: (available hoist5) (at crate11 distributor2) (clear crate11) (on crate11 pallet6)
   goals met: 10 of 11
124. (unload hoist5 crate13 truck0 distributor2)
   deleted: (in crate13 truck0) (available hoist5)
   added: (lifting hoist5 crate13)
   goals met: 10 of 11
125. (drop hoist5 crate13 crate11 distributor2)
   deleted: (lifting hoist5 crate13) (clear crate11)
   added: (available hoist5) (at crate13 distributor2) (clear crate13) (on crate13 crate11)
   goals met: 11 of 11
